'''
변수 - 값을 담을수 있는 메모리 저장 공간

변수명 = 값

변수타입(값 종류)
기본형
    1. 부울(bool) - True, False
        부울변수1 = True
        부울변수2 = False
    2. 정수(int) - 메모리 허용 음수, 0, 양수
        num1 = 1
        num2 = 2
    3. 실수(float) - 소수점 포함 숫자
        fNum1 = 3.14
        fNum2 = 2.7
    4. 문자열(str) - 문자 저장  쌍따옴표 ("")또는 작은 따옴표('')
        str1 = "Hello Python"
        str2 = '안녕하세요!'

컬렉션형(자료구조형) -
    1. list - 순서가 있는 데이터 집합
        list1 = ['값1', '값2', '값3']
        list2 = ['값1',  10, 3.14]
    2. tuple - list 비슷하지만 수정 불가능
        tuple1 = ('값1', '값2', '값3')
        tuple2 = ('값1', 10, 3.14)
    3. set - 순서가 없고, 중복허용하지 않는 데이터 집합
        set1 = {'값1', '값2', '값3'}
        set1 = {'값1', 10, 3.14}


변수명.메소드()
'''